; domain
(define (domain duct_tape_necklace)
  (:requirements :strips :typing)
  (:types 
    tape 
    table 
    ends
  )
  (:predicates 
    (rolled ?t - tape)
    (in_pieces ?t - tape)
    (on_roll ?t - tape)
    (measured ?t - table)
    (elongated ?t - tape)
    (folded ?t - tape)
    (sticky ?t - tape)
    (smooth ?t - tape)
    (separate_pieces ?t - tape)
    (one_piece ?t - tape)
    (separate_ends ?e - ends)
    (touching_ends ?e - ends)
    (bare_ends ?e - ends)
    (joined_ends ?e - ends)
  )
  (:action unroll_tape
    :parameters (?t - tape)
    :precondition (and (rolled ?t) (on_roll ?t))
    :effect (and (in_pieces ?t) (not (rolled ?t)))
  )
  (:action measure_and_cut_tape
    :parameters (?t - tape ?tb - table)
    :precondition (and (in_pieces ?t) (elongated ?t) (not (measured ?tb)))
    :effect (and (measured ?tb) (in_pieces ?t))
  )
  (:action fold_tape
    :parameters (?t - tape)
    :precondition (and (in_pieces ?t) (elongated ?t))
    :effect (and (folded ?t) (not (elongated ?t)))
  )
  (:action smooth_tape
    :parameters (?t - tape)
    :precondition (and (folded ?t) (sticky ?t))
    :effect (and (smooth ?t) (not (sticky ?t)))
  )
  (:action tape_ends_together
    :parameters (?t - tape ?e - ends)
    :precondition (and (smooth ?t) (separate_pieces ?t) (separate_ends ?e))
    :effect (and (one_piece ?t) (joined_ends ?e) (not (separate_ends ?e)) (not (separate_pieces ?t)))
  )
)

; problem
(define (problem make_duct_tape_necklace)
  (:domain duct_tape_necklace)
  (:objects
    tape1 - tape
    table1 - table
    ends1 - ends
  )
  (:init
    (rolled tape1)
    (on_roll tape1)
    (elongated tape1)
    (sticky tape1)
    (separate_pieces tape1)
    (separate_ends ends1)
    (not (measured table1))
    (not (folded tape1))
    (not (in_pieces tape1))
    (not (smooth tape1))
    (not (one_piece tape1))
    (not (touching_ends ends1))
    (not (joined_ends ends1))
  )
  (:goal
    (and 
      (one_piece tape1)
      (joined_ends ends1)
    )
  )
)

; plan
1. (unroll_tape tape1)
   deleted: (rolled tape1)
   added: (in_pieces tape1)
   goals met: 0 of 2
2. (fold_tape tape1)
   deleted: (elongated tape1)
   added: (folded tape1)
   goals met: 0 of 2
3. (smooth_tape tape1)
   deleted: (sticky tape1)
   added: (smooth tape1)
   goals met: 0 of 2
4. (tape_ends_together tape1 ends1)
   deleted: (separate_ends ends1) (separate_pieces tape1)
   added: (one_piece tape1) (joined_ends ends1)
   goals met: 2 of 2
